package io.kit.translate;

public enum ErrorMessage {
    E_52000("52000", "成功"),
    E_52001("52001", "请求超时, 检查请求query是否超长，以及原文或译文参数是否在支持的语种列表里"),
    E_52002("52002", "系统错误, 请重试"),
    E_52003("52003", "未授权用户, 请检查appid是否正确或者服务是否开通"),
    E_54000("54000", "必填参数为空, 请检查是否少传参数"),
    E_54001("54001", "签名错误, 请检查您的签名生成方法"),
    E_54003("54003", "访问频率受限, 请降低您的调用频率，或在控制台进行身份认证后切换为高级版/尊享版"),
    E_54004("54004", "账户余额不足, 请前往管理控制台为账户充值"),
    E_54005("54005", "长query请求频繁, 请降低长query的发送频率，3s后再试"),
    E_58000("58000", "客户端IP非法,  检查个人资料里填写的IP地址是否正确，可前往开发者信息-基本信息修改"),
    E_58001("58001", "译文语言方向不支持, 检查译文语言是否在语言列表里"),
    E_58002("58002", "服务当前已关闭, 请前往管理控制台开启服务"),
    E_58003("58003", "此IP已被封禁, 同一IP当日使用多个APPID发送翻译请求，则该IP将被封禁当日请求权限，次日解封。请勿将APPID和密钥填写到第三方软件中"),
    E_90107("90107", "认证未通过或未生效, 请前往我的认证查看认证进度"),
    E_20003("20003", "请求内容存在安全风险, 请检查请求内容");
    String code;
    String message;

    ErrorMessage(String code, String msg) {
        this.code = code;
        this.message = msg;
    }

    public static String byCode(String code) {
        for (ErrorMessage value : values()) {
            if (value.code.equals(code)) return value.message;
        }
        return code;
    }
}
